import React from "react";
import Img from "../../src/components/Image";
import { withLayout } from "../../src/layout/Layout";
import BlogImageOne from "../../public/images/blog_image_1.webp";
import BlogImageTwo from "../../public/images/blog_image_2.webp";
import BlogImageThree from "../../public/images/blog_image_3.webp";
import BlogImageFour from "../../public/images/blog_image_4.webp";
import BlogImageFive from "../../public/images/blog_image_5.webp";

const blogItems = [
  {
    id: 1,
    img: BlogImageOne,
    title: "Прикарпат Гарант. Історія створення організації та наша мета.",
    text: "22 Лютого 2022 року - Російське вторгнення в Україну. Неприпинне бомбардування міст та сіл України. Гинуть люди, гинуть діти, гине все живе внаслідок російських ракет. Люди починають обєднуватися та ставати на захист своєї країни.\nЙшов пятий місяць війни. Я, Лікаренко Петро Васильович регіструю свою благодійну організацію, щоб мати можливість допомогти країні. 21 Липня 2022 року, в місті Івано-Франківськ була офіційно зарегістрована благодійна організація «Прикарпат Гарант».\nМета нашої організації чітка і непохитна: розширювати можливость спільнот та створювати позитивні зміни для людей та нашої країни.",
    date: "16.09.2023",
  },
  {
    id: 2,
    img: BlogImageTwo,
    title: "Аграрний сектор України.",
    text: "Оскільки основною задачою нашого фонду є допомога серед інших аграрним підприємствам, яке в наслідок російської агресії зазнали шкоди та перебувають в складному становищі через брак коштів, мобілізованих працівників, смерть чи калітство внаслідок бойових дій, знищення техніки або спец техніки, відсутність збуту продукції, експорт та інші.\nДля аграрного сектору вкрай важливі забезпечення як добривами так і паливно-мастильні матеріали. На все ціна зростає, з метою реалізації своїх цілей, організація співпрацює з двома виробниками.\nВиробник мікродобрив: ТЗОВ «ЕКОХІМІФ» ти виробник пального та паливних матеріалів: ПП «ПРИКАРПАТКОМПЛЕКТ».\nВищевказані виробники підтримують економіку держави у складний період.",
    date: "16.09.2023",
  },
  {
    id: 3,
    img: BlogImageThree,
    title: "Біженці в сьогоденній політиці. ",
    text: "Проблема біженців є питанням номер один у всіх державах світу, а також їхнє правове положення, визначення статусу міжнародних документів, вирішенню питань в нормативному визначенні поняття «біженец», його прав і захисту в політичному і збройному конфліктах які виходять на міжнародний рівень.\nПовномаштабна війна в Україні змусила мільйони Українців залишити свої домівки. На даний момент за кордоном перебувають близько 6,2 мільйона українських біженців, але куди б не втекли ми від бомб чи ракет, ми завжди залишаємося думкою і серцем в Україні. Кожен переживає за своє життя, за родину, за незалежність, свободу, право бути собою.\nЄвропейці відкрили для нас свої серця, дали можливість працювати, ми отримали такі самі привілеї як і громадяни Європейських країн. Діти ходять до школи, а батьки мають можливість вільно спілкуватися з рідними та друзями. Все це завдяки правам які були надані нам прийнявши статус беженця.",
    date: "20.09.2023",
  },
  {
    id: 4,
    img: BlogImageFour,
    title: "Наші цінності. ",
    text: "Наша місія ґрунтується на низці основних цінностей, якими керуємося в усіх наших діях:\nЕмпатія: ми віримо в силу розуміння та співчуття, визнаючи, що у кожного є унікальні труднощі та прагнення.\nСпівпраця: ми знаємо, що тривалих змін найкраще досягти, коли ми працюємо разом із спільнотами, партнерами та волонтерами, які поділяють наше бачення.\nСталість: ми прагнемо створювати програми, які мають тривалий вплив, гарантуючи, що позитивні зміни, яким ми сприяємо, триватимуть ще довго після нашої початкової участі.\nПрозорість: ми підтримуємо найвищий рівень прозорості в наших операціях, забезпечуючи ефективне та відповідальне використання кожної пожертви та ресурсу.\nІнновації: ми постійно шукаємо інноваційні рішення для вирішення нових викликів і створення нових можливостей для зростання.",
    date: "25.09.2023",
  },
  {
    id: 5,
    img: BlogImageFive,
    title: "Розширення можливостей спільнот. ",
    text: "Ми віримо в внутрішній потенціал кожної спільноти для створення позитивних змін. Наш підхід полягає в наданні інструментів, ресурсів і підтримки, необхідних для розкриття цього потенціалу. Ми тісно співпрацюємо з громадами, щоб визначити їхні унікальні сильні сторони та проблеми, сприяючи розвитку почуття власності та розширення можливостей серед мешканців.\nПеретворення життя: наша кінцева мета — зробити тривалий, значущий вплив на життя людей у цих спільнотах. Ми вимірюємо свій успіх не лише цифрами, але й історіями про особисте зростання, стійкість і успіх, які випливають із наших програм. Незалежно від того, чи йдеться про допомогу дитині в отриманні якісної освіти, чи про підтримку сім’ї, яка має проблеми з основними потребами, ми прагнемо змінити життя на краще.",
    date: "26.09.2023",
  }
];

const BlogEntry = ({ blogItem }) => {
  return (
    <div className="blog-entry">
      <div className="blog-entry-header">
        <h1 className="blog-entry-header__title">{blogItem.title}</h1>
        <p className="blog-entry-header__date">{blogItem.date}</p>
        <Img
          src={blogItem.img}
          alt={"Зображення"}
          className="blog-entry-header__image"
        />
      </div>
      <div className="blog-entry-content">
        {blogItem.text.split("\n").map((line, index) => (
          <p key={index} className="blog-entry-content__text">
            {line}
          </p>
        ))}
      </div>
    </div>
  );
};

export async function getStaticPaths() {
  const paths = blogItems.map((blogItem) => {
    return {
      params: {
        id: blogItem.id.toString(),
      },
    };
  });

  return {
    paths,
    fallback: false,
  };
}

export async function getStaticProps({ params }) {
  const blogItem = blogItems.find((obj) => obj.id === parseInt(params.id));
  return {
    props: {
      blogItem,
    },
  };
}

export default withLayout(BlogEntry);
